Autodesk.Revit.DB.GeometryInstance.GetInstanceGeometry(Autodesk.Revit.DB.Transform)
Computes a transformation of the geometric representation of the instance.
Returns: An element which contains the computed geometry for the transformed instance.
transform: The transformation to apply to the geometry.
Remarks: The context of the instance object (such as effective material) will be applied to the symbol.
Note that this method involves extensive parsing or Revit's data structures, so try to
minimize calls if performance is critical.
Geometry will be parsed with the same options as those used when this object was retrieved.
This method returns a copy of the Revit geometry.  It is suitable for use in a tool which extracts
geometry to another format or carries out a geometric analysis; however, because it returns a copy
the references found in the geometry objects contained in this element are not suitable for
creating new Revit elements referencing the original element (for example, dimensioning).
Only the geometry returned by GetSymbolGeometry() with no transform can be used for that purpose.
Throws Autodesk.Revit.Exceptions.ArgumentException: Transform is not conformal

Autodesk.Revit.DB.GeometryInstance.GetInstanceGeometry
Computes the geometric representation of the instance.
Returns: An element which contains the computed geometry for the instance.
Remarks: The geometry will be in the coordinate system of the model that owns this instance.
The context of the instance object (such as effective material) will be applied to the symbol.
Note that this method involves extensive parsing or Revit's data structures, so try to
minimize calls if performance is critical.
Geometry will be parsed with the same options as those used when this object was retrieved.
This method returns a copy of the Revit geometry.  It is suitable for use in a tool which extracts
geometry to another format or carries out a geometric analysis; however, because it returns a copy
the references found in the geometry objects contained in this element are not suitable for
creating new Revit elements referencing the original element (for example, dimensioning).
Only the geometry returned by GetSymbolGeometry() with no transform can be used for that purpose.

Autodesk.Revit.DB.GeometryInstance.GetSymbolGeometry(Autodesk.Revit.DB.Transform)
Computes a transformation of the geometric representation of the symbol
which generates this instance.
transform: The transformation to apply to the geometry.
Returns: An element which contains the computed geometry for the transformed symbol.
Remarks: The context of this instance object (such as effective material)
will be applied to the symbol.
Note that this method involves extensive parsing or Revit's data structures, so try to
minimize calls if performance is critical.
Geometry will be parsed with the same options as those used when this object was retrieved.
This method returns a copy of the Revit geometry.  It is suitable for use in a tool which extracts
geometry to another format or carries out a geometric analysis; however, because it returns a copy
the references found in the geometry objects contained in this element are not suitable for
creating new Revit elements referencing the original element (for example, dimensioning).
Only the geometry returned by GetSymbolGeometry() with no transform can be used for that purpose.
Throws Autodesk.Revit.Exceptions.ArgumentException: Transform is not conformal

Autodesk.Revit.DB.GeometryInstance.GetSymbolGeometry
Computes the geometric representation of the symbol which generates this instance.
Returns: An element which contains the computed geometry for the symbol.
Remarks: The geometry will be in the local coordinate space of the symbol.
The context of this instance object (such as effective material) will be applied to the symbol.
Note that this method involves extensive parsing or Revit's data structures, so try to
minimize calls if performance is critical.
Geometry will be parsed with the same options as those used when this object was retrieved.
The results of the method and the value of the SymbolGeometry property are identical.
This method returns the actual Revit geometry.  Unlike other methods which extract transformed
copies of the geometry, the return value of this method is suitable for
creating new Revit elements referencing the original element (for example, dimensioning).

Autodesk.Revit.DB.GeometryInstance.SymbolGeometry
The geometric representation of the symbol which generates this instance.
Remarks: The geometry will be in the local coordinate space of the symbol.
The context of this instance object (such as effective material) will be applied to the symbol.
Note that retrieving the value of this property involves extensive parsing or Revit's data
structures, so try to minimize calls if performance is critical.
Geometry will be parsed with the same options as those used when this object was retrieved.
The value of this property and the results of the method GetSymbolGeometry(void) are identical.

Autodesk.Revit.DB.GeometryInstance.Symbol
The symbol element that this object is referring to.

Autodesk.Revit.DB.GeometryInstance.Transform
The affine transformation from the local coordinate space of the symbol into the
coordinate space of the instance.

Autodesk.Revit.DB.GeometryInstance
An instance of another element (symbol), specially positioned by this
element.
Remarks:
A GeometryInstance represents a set of geometry stored by Revit in a default configuration, and then transformed
into the proper location as a result of the properties of the element.  The most common situation where
GeometryInstances are encountered is in Family instances.  Revit uses GeometryInstances to allow it to store a
single copy of the geometry for a given family and reuse it in multiple instances.
Note that not all Family instances will include GeometryInstances.  When Revit needs to make a unique copy of the
family geometry for a given instance (because of the effect of local joins, intersections, and other factors
related to the instance placement) no GeometryInstance will be encountered; instead the Solid geometry will be found
at the top level of the hierarchy.
A GeometryInstance offers the ability to read its geometry through the GetSymbolGeometry() and
GetInstanceGeometry() methods.  These methods return another Autodesk.Revit.DB.GeometryElement
which can be parsed just like the first level return.